test/cassettes/refunds/create.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Expect: ''
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","email":"test@example.com","phone":"5555555555"},"from_address":{"name":"Elizabeth Swan","street1":"179 N Harbor Dr","city":"Redondo Beach","state":"CA","zip":"90277","country":"US","email":"test@example.com","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"},"carbon_offset":"false"}'
    response:
        status:
            http_version: '1.1'
            code: '201'
            message: Created
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 4d593b6563911725e78b1b27001d5d5f
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_963678c4a9fd48c4ae9a250c3031c4fe
            content-type: 'application/json; charset=utf-8'
            content-length: '7077'
            etag: 'W/"dafb4690836350da39fe9192a820159e"'
            x-runtime: '1.130962'
            x-node: bigweb1nuq
            x-version-label: easypost-202212072114-cbd87d5dd7-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 29913d444b', 'extlb1nuq 29913d444b']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-12-07T22:43:49Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100106068158608454","updated_at":"2022-12-07T22:43:50Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_9dbf6bb9768011ed83beac1f6b0a0d1e","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_298cf44ca17841faa6ea9dfc1e84743a","object":"Parcel","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_e556f99d0a804f80894fb1da61d5805a","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:50Z","date_advance":0,"integrated_form":"none","label_date":"2022-12-07T22:43:49Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20221207\/85b9f4adb73346c89a5fdb1cb213a5e5.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_945d70c162de40709c21b7ce63068efd","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"Express","carrier":"USPS","rate":"29.75","currency":"USD","retail_rate":"33.85","retail_currency":"USD","list_rate":"29.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_db785aa9ba894d5d862518382ecd1df2","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"Priority","carrier":"USPS","rate":"8.15","currency":"USD","retail_rate":"9.75","retail_currency":"USD","list_rate":"8.15","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_74a2723f140e4feea11f865d61d676e0","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"8.00","currency":"USD","retail_rate":"8.00","retail_currency":"USD","list_rate":"8.00","list_currency":"USD","billing_type":"easypost","delivery_days":5,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":5,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_5872e8daadee4e1f875cab777da15e30","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.82","currency":"USD","retail_rate":"5.82","retail_currency":"USD","list_rate":"5.82","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_5872e8daadee4e1f875cab777da15e30","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.82","currency":"USD","retail_rate":"5.82","retail_currency":"USD","list_rate":"5.82","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_957f1919a6c8489089e65189ffc50495","object":"Tracker","mode":"test","tracking_code":"9400100106068158608454","status":"unknown","status_detail":"unknown","created_at":"2022-12-07T22:43:50Z","updated_at":"2022-12-07T22:43:50Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzk1N2YxOTE5YTZjODQ4OTA4OWU2NTE4OWZmYzUwNDk1"},"to_address":{"id":"adr_9dbcef02768011edae69ac1f6bc7b362","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_9dbf6bb9768011ed83beac1f6b0a0d1e","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_9dbcef02768011edae69ac1f6bc7b362","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.82000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 803
            request_size: 885
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.352159
            namelookup_time: 0.002479
            connect_time: 0.068274
            pretransfer_time: 0.15398
            size_upload: 577.0
            size_download: 7077.0
            speed_download: 5233.0
            speed_upload: 426.0
            download_content_length: 7077.0
            upload_content_length: 577.0
            starttransfer_time: 1.352101
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.25
            local_port: 58526
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 153795
            connect_time_us: 68274
            namelookup_time_us: 2479
            pretransfer_time_us: 153980
            redirect_time_us: 0
            starttransfer_time_us: 1352101
            total_time_us: 1352159
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_963678c4a9fd48c4ae9a250c3031c4fe'
        headers:
            Host: api.easypost.com
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
    response:
        status:
            http_version: '1.1'
            code: '200'
            message: OK
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 4d593b5f63911727e78b1b28001d5e05
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8211'
            etag: 'W/"31d20a05bb3d462ceb9fdc9432d7c321"'
            x-runtime: '0.161412'
            x-node: bigweb6nuq
            x-version-label: easypost-202212072114-cbd87d5dd7-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 29913d444b', 'extlb1nuq 29913d444b']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-12-07T22:43:49Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100106068158608454","updated_at":"2022-12-07T22:43:50Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_9dbf6bb9768011ed83beac1f6b0a0d1e","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_298cf44ca17841faa6ea9dfc1e84743a","object":"Parcel","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_e556f99d0a804f80894fb1da61d5805a","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:50Z","date_advance":0,"integrated_form":"none","label_date":"2022-12-07T22:43:49Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20221207\/85b9f4adb73346c89a5fdb1cb213a5e5.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_945d70c162de40709c21b7ce63068efd","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"Express","carrier":"USPS","rate":"29.75","currency":"USD","retail_rate":"33.85","retail_currency":"USD","list_rate":"29.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_db785aa9ba894d5d862518382ecd1df2","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"Priority","carrier":"USPS","rate":"8.15","currency":"USD","retail_rate":"9.75","retail_currency":"USD","list_rate":"8.15","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_74a2723f140e4feea11f865d61d676e0","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"8.00","currency":"USD","retail_rate":"8.00","retail_currency":"USD","list_rate":"8.00","list_currency":"USD","billing_type":"easypost","delivery_days":5,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":5,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_5872e8daadee4e1f875cab777da15e30","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.82","currency":"USD","retail_rate":"5.82","retail_currency":"USD","list_rate":"5.82","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_5872e8daadee4e1f875cab777da15e30","object":"Rate","created_at":"2022-12-07T22:43:49Z","updated_at":"2022-12-07T22:43:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.82","currency":"USD","retail_rate":"5.82","retail_currency":"USD","list_rate":"5.82","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_957f1919a6c8489089e65189ffc50495","object":"Tracker","mode":"test","tracking_code":"9400100106068158608454","status":"pre_transit","status_detail":"status_update","created_at":"2022-12-07T22:43:50Z","updated_at":"2022-12-07T22:43:50Z","signed_by":null,"weight":null,"est_delivery_date":"2022-12-07T22:43:50Z","shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-11-07T22:43:50Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-11-08T11:20:50Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzk1N2YxOTE5YTZjODQ4OTA4OWU2NTE4OWZmYzUwNDk1"},"to_address":{"id":"adr_9dbcef02768011edae69ac1f6bc7b362","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_9dbf6bb9768011ed83beac1f6b0a0d1e","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_9dbcef02768011edae69ac1f6bc7b362","object":"Address","created_at":"2022-12-07T22:43:49+00:00","updated_at":"2022-12-07T22:43:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"<REDACTED>","email":"<REDACTED>","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.82000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_963678c4a9fd48c4ae9a250c3031c4fe","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_963678c4a9fd48c4ae9a250c3031c4fe'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 732
            request_size: 323
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.373223
            namelookup_time: 0.001671
            connect_time: 0.066914
            pretransfer_time: 0.140173
            size_upload: 0.0
            size_download: 8211.0
            speed_download: 22000.0
            speed_upload: 0.0
            download_content_length: 8211.0
            upload_content_length: 0.0
            starttransfer_time: 0.37308
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.25
            local_port: 58527
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 140144
            connect_time_us: 66914
            namelookup_time_us: 1671
            pretransfer_time_us: 140173
            redirect_time_us: 0
            starttransfer_time_us: 373080
            total_time_us: 373223
-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/refunds'
        headers:
            Host: api.easypost.com
            Expect: ''
            Accept-Encoding: ''
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"refund":{"carrier":"USPS","tracking_codes":"9400100106068158608454"}}'
    response:
        status:
            http_version: '1.1'
            code: '201'
            message: Created
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 4d593b6063911728e78b1b29001d5e50
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '297'
            etag: 'W/"eab7ee5ee2fff24d00f7007aaee74df3"'
            x-runtime: '0.094102'
            x-node: bigweb9nuq
            x-version-label: easypost-202212072114-cbd87d5dd7-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 29913d444b', 'extlb1nuq 29913d444b']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '[{"id":"rfnd_6313c3a7f10d4578bd7ecbf9519f0367","object":"Refund","created_at":"2022-12-07T22:43:52Z","updated_at":"2022-12-07T22:43:52Z","tracking_code":"9400100106068158608454","confirmation_number":null,"status":"submitted","carrier":"USPS","shipment_id":"shp_963678c4a9fd48c4ae9a250c3031c4fe"}]'
        curl_info:
            url: 'https://api.easypost.com/v2/refunds'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 736
            request_size: 376
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.305367
            namelookup_time: 0.001716
            connect_time: 0.068453
            pretransfer_time: 0.143037
            size_upload: 71.0
            size_download: 297.0
            speed_download: 972.0
            speed_upload: 232.0
            download_content_length: 297.0
            upload_content_length: 71.0
            starttransfer_time: 0.305305
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.25
            local_port: 58528
            http_version: 2
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 143004
            connect_time_us: 68453
            namelookup_time_us: 1716
            pretransfer_time_us: 143037
            redirect_time_us: 0
            starttransfer_time_us: 305305
            total_time_us: 305367
